Revit 2027 API
FabricationConfiguration.GetSpecificationGroup Method
 Gets the specification group from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetSpecificationGroup(
	int specId
)
Public Function GetSpecificationGroup (
	specId As Integer
) As String
public:
String^ GetSpecificationGroup(
	int specId
)
member GetSpecificationGroup :
        specId : int -> string
Parameters
specId Int32
 The specification identifier.
Return Value
String
 The specification group.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace